app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["title", "test"], ["body", "test"], ["created_at", "2018-01-10 19:54:10.241676"], ["updated_at", "2018-01-10 19:54:10.241676"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save